package org.itmo.java.lesson4.homework4;

public class SumNumbers {
    /*
3.	Напишите программу, чтобы вычислить сумму двух целых чисел и вернуть true, если сумма равна третьему целому числу.
 Пример вывода:
Введите первое число: 5
Введите второе число: 10
Введите третье число: 15
Результат: true
     */
    public static void sumNumber(int a, int b, int c) {
        System.out.println(a + b == c);
    }
}
